espressif/esp-matter/examples/camera/split_mode/sdkconfig.defaults.esp32c6
CONFIG_IDF_TARGET="esp32c6"

#Singnling Specific config

# Slave
CONFIG_LWIP_TCP_LOCAL_PORT_RANGE_START=61440
CONFIG_LWIP_TCP_LOCAL_PORT_RANGE_END=65535
CONFIG_LWIP_UDP_LOCAL_PORT_RANGE_START=61440
CONFIG_LWIP_UDP_LOCAL_PORT_RANGE_END=65535
CONFIG_ESP_DEFAULT_LWIP_SLAVE=y

# 6K is sufficient for signalling_only
CONFIG_MAIN_TASK_STACK_SIZE=4000

CONFIG_MAX_LARGE_BUFFER_SIZE_BYTES=8192
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=8192

# OS
CONFIG_FREERTOS_HZ=1000

CONFIG_ESP_WIFI_EXTRA_IRAM_OPT=n
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=24
CONFIG_LWIP_TCP_OVERSIZE_QUARTER_MSS=y
CONFIG_LWIP_TCP_ACCEPTMBOX_SIZE=4

CONFIG_ESP_WEBRTC_BRIDGE_HOSTED=y

# DANGER: Do not touch me!!!
# CONFIG_HOSTED_ON_LOW_MEM=y
CONFIG_ESP_CACHE_MALLOC=y
CONFIG_ESP_PKT_STATS=y

#
# ESP-Hosted - Network coprocessor
#
CONFIG_ESP_HOSTED_NETWORK_SPLIT_ENABLED=y
CONFIG_ESP_SDIO_RX_Q_SIZE=5
CONFIG_ESP_SDIO_TX_Q_SIZE=5

# Disable ESP-Hosted coprocessor app_main (we provide our own)
CONFIG_ESP_HOSTED_COPROCESSOR_APP_MAIN=n

# Create wifi sta in example, instead of internal slave code base
CONFIG_ESP_HOSTED_REUSE_WIFI_STA_DEF_NETIF_INSTANCE=y
CONFIG_ESP_HOSTED_COPROCESSOR_BT_ENABLED=n

# Hosted - Reuse CLI instance
CONFIG_ESP_HOSTED_CLI_NEW_INSTANCE=n

# Hosted : Host deep sleep & wake up
CONFIG_ESP_SDIO_STREAMING_MODE=n
CONFIG_ESP_HOSTED_HOST_POWER_SAVE_ENABLED=y
CONFIG_ESP_HOSTED_HOST_DEEP_SLEEP_ALLOWED=y
CONFIG_ESP_HOSTED_UNLOAD_BUS_DRIVER_DURING_HOST_SLEEP=y
CONFIG_ESP_HOSTED_HOST_WAKEUP_GPIO=2
